## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/200962)



<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.corpus_events_sns_topic_subscription



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.corpus_events_sns_topic_subscription will be created
  + resource "aws_sns_topic_subscription" "corpus_events_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:UserListSearch-Prod-CorpusEvents"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"d52a0608-0bce-41b6-a210-f87a14a39e83","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":574,"Program":"tfcmt","SHA1":"4370dd9045835ad1f64108384f9ee8297cd58b96","Target":"user-list-search-cdk","Vars":{}} -->